УРВ_файловая/src/InformationRegisters/ОтправленныеОповещенияПоСоглашениям/ОтправленныеОповещенияПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправленныеОповещенияПоСоглашениям</name>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.Обращение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/ОтправленныеОповещенияПоСоглашениям/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет оповещение по обращению
//
// Параметры:
//  Параметры - Структура - параметры оповещения:
//  * Обращение - ДокументСсылка.Обращение - обращение оповещения.
//  * Соглашение - СправочникСсылка.Соглашения - соглашение оповещения.
//  * КлючПараметров - Строка(36) - ключ параметров.
//  * КлючОповещения - Строка(36) - ключ оповещения.
//
Процедура ДобавитьОповещение(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Параметры, "Обращение, Соглашение, КлючПараметров, КлючОповещения");
	Менеджер.Записать();
	
КонецПроцедуры

// Удаляет оповещения по обращению
//
// Параметры:
//  Обращение - ДокументСсылка.Обращение - обращение оповещения.
//
Процедура УдалитьОповещенияПоОбращению(Обращение) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОтправленныеОповещенияПоСоглашениям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Обращение, Истина);
	НаборЗаписей.Записать();
	
КонецПроцедуры
  
#КонецОбласти 

#КонецЕсли
